import "./Section5.scss"
import { Photo } from "../../../Images.js"
import { useState } from "react"

const why = [
    {title: "Опыт", descr1: "Мы работаем уже 30 лет и накопили уникальный опыт. Любые трудности для нас это пустяк", descr2: "Для компаний с маленьким опытом работы любая сложность может стать причиной технических ошибок, срыва сроков и непредвиденных расходов"},
    {title: "Качество", descr1: "Мы проводим весь необходимый комплекс работ для каждого объекта. Это гарантирует 100% прохождение экспертизы", descr2: "Наши конкуренты, гонясь за низкой ценой и высокой прибылью, зачастую недобросовестно подходят к работе. Они забывают, что ИИ – одно из самых ответственных стадий проектирования"},
    {title: "Оперативность", descr1: "Мы даем быстрый ответ на ваше обращение. Обычно в течение часа", descr2: "Заявка обрабатывается два-три дня"},
    {title: "Кадры", descr1: "В нашей профессиональной команде 13 высококвалифицированных специалистов. Из них 3 кандидата, 1 доктор наук, 2 эксперта", descr2: "Другие компании экономят на качественных кадрах. Неточные данные изысканий могут привести к некорректным проектным решениям"},
    {title: "Сроки", descr1: "Мы обладаем огромным опытом и собственной уникальной базой пройденных скважин. Это позволяет нам предвидеть проблемы и работать значительно быстрее конкурентов, и никогда не нарушать условия договора", descr2: "Большинство других компаний не укладываются в сроки"},
]

export default function Section4(){

    return(
        <>
            <section className="p3s5-section">
                <div className="p3s5-inner">
                    <div className="p3s5-header">
                        <p className="sub-label">Чем мы отличаемся?</p>
                        <h2>НАШИ ПРЕИМУЩЕСТВА</h2>
                    </div>
                    <div className="p3s5-adv-list">
                        {why.map((meow) => (
                            <div className="p3s5-adv-box">
                                <h2>{meow.title}</h2>
                                <div className="p3s5-box-cols">
                                    <div className="p3s5-col-us">
                                        <h3>Как это делаем мы</h3>
                                        <p>{meow.descr1}</p>
                                    </div>
                                    <div className="p3s5-col-them">
                                        <h3>Как это делают другие</h3>
                                        <p>{meow.descr2}</p>
                                    </div>
                                </div>
                            </div>
                        ))}
                    </div>
                </div>
            </section>
        </>
    )
}